def _tic_tak_toe_status(field: list[list[str]], move: str) -> bool:
    cell_count = len(field)

    for i in range(cell_count):
        lines = [[field[j][i] for j in range(cell_count)], field[i]]
        for line in lines:
            if line.count(move) == cell_count:
                return True

    secondary_diagonal = [field[i][cell_count - i - 1] for i in range(cell_count)]
    main_diagonal = [field[i][i] for i in range(cell_count)]

    for line in (secondary_diagonal, main_diagonal):
        if line.count(move) == len(field):
            return True

    return False


def _get_heart_stickers() -> tuple[tuple[str, ...] , ...]:
    return (
        (
            f'🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤🖤❤️🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',

        ),
        (
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤❤️❤️❤️🖤🖤🖤',
            '🖤🖤🖤🖤❤️🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
        ),
        (
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤❤️❤️🖤❤️❤️🖤🖤',
            '🖤🖤❤️❤️❤️❤️❤️🖤🖤',
            '🖤🖤🖤❤️❤️❤️🖤🖤🖤',
            '🖤🖤🖤🖤❤️🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
        ),
        (
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
            '🖤🖤❤️❤️🖤❤️❤️🖤🖤',
            '🖤❤️❤️❤️❤️❤️❤️❤️🖤',
            '🖤❤️❤️❤️❤️❤️❤️❤️🖤',
            '🖤🖤❤️❤️❤️❤️❤️🖤🖤',
            '🖤🖤🖤❤️❤️❤️🖤🖤🖤',
            '🖤🖤🖤🖤❤️🖤🖤🖤🖤',
            '🖤🖤🖤🖤🖤🖤🖤🖤🖤',
        ),
        (
            '🖤❤️❤️❤️🖤❤️❤️❤️🖤',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '🖤❤️❤️❤️❤️❤️❤️❤️🖤',
            '🖤🖤❤️❤️❤️❤️❤️🖤🖤',
            '🖤🖤🖤❤️❤️❤️🖤🖤🖤',
            '🖤🖤🖤🖤❤️🖤🖤🖤🖤',
        ),
        (
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '🖤❤️❤️❤️❤️❤️❤️❤️🖤',
            '🖤🖤❤️❤️❤️❤️❤️🖤🖤',
            '🖤🖤🖤❤️❤️❤️🖤🖤🖤',
        ),
        (
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️🤍❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
        ),
        (
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️🤍🤍🤍❤️❤️❤️',
            '❤️❤️❤️❤️🤍❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
        ),
        (
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️🤍🤍❤️🤍🤍❤️❤️',
            '❤️❤️🤍🤍🤍🤍🤍❤️❤️',
            '❤️❤️❤️🤍🤍🤍❤️❤️❤️',
            '❤️❤️❤️❤️🤍❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
        ),
        (
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
            '❤️❤️🤍🤍❤️🤍🤍❤️❤️',
            '❤️🤍🤍🤍🤍🤍🤍🤍❤️',
            '❤️🤍🤍🤍🤍🤍🤍🤍❤️',
            '❤️❤️🤍🤍🤍🤍🤍❤️❤️',
            '❤️❤️❤️🤍🤍🤍❤️❤️❤️',
            '❤️❤️❤️❤️🤍❤️❤️❤️❤️',
            '❤️❤️❤️❤️❤️❤️❤️❤️❤️',
        )

    )